In [86]:
import pandas as pd

# Задача №1

In [88]:
data = pd.read_csv('C:/Users/vokea/OneDrive/Рабочий стол/Mishin/ml-latest-small/ratings.csv', sep=',')

In [89]:
data.info() ##проверяем заполненность данных

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [90]:
data_filter = data[data['rating'].isin(['5.0'])] ##фильтруем по рейтингу

In [91]:
del data_filter['timestamp'] ##очищаем данные, удаляем лишний столбец

In [105]:
data_filter['counts'] = 1 ##добавляем новый столбец

<ipython-input-105-dc1ddf599922>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_filter['counts'] = 1 ##добавляем новый столбец

In [106]:
data_movies = pd.read_csv('C:/Users/vokea/OneDrive/Рабочий стол/Mishin/ml-latest-small/movies.csv', sep=',')

In [107]:
del data_movies['genres'] ##очищаем данные, удаляем лишний столбец

In [108]:
join_movies = data_filter.merge(data_movies, on='movieId', how='left')

In [109]:
join_movies.head(2)

   userId  movieId  rating  counts                        title
0       1       47     5.0       1  Seven (a.k.a. Se7en) (1995)
1       1       50     5.0       1   Usual Suspects, The (1995)

In [110]:
data_grp = join_movies.groupby(['movieId', 'title']) ## аггрегируем по movieId
df_groupby_sum = data_grp.sum() ## считаем сумму
df_groupby_sum.head(4)

                                            userId  rating  counts
movieId title
1       Toy Story (1995)                     13983   235.0      47
2       Jumanji (1995)                        2192    35.0       7
3       Grumpier Old Men (1995)               1376    30.0       6
5       Father of the Bride Part II (1995)     218    15.0       3

In [111]:
data_grp_only_need = data_grp[["movieId", "counts", "title"]] ## оставляем только необходимые столбцы
data_grp_only_need.head(4)

       movieId  counts                          title
0           47       1    Seven (a.k.a. Se7en) (1995)
1           50       1     Usual Suspects, The (1995)
2          101       1           Bottle Rocket (1996)
3          151       1                 Rob Roy (1995)
4          157       1          Canadian Bacon (1995)
...        ...     ...                            ...
13204   138632       1             Tokyo Tribe (2014)
13205   156371       1    Everybody Wants Some (2016)
13206   158238       1           The Nice Guys (2016)
13208   168248       1  John Wick: Chapter Two (2017)
13209   168250       1                 Get Out (2017)

[6308 rows x 3 columns]

In [112]:
sorted_df = df_groupby_sum.sort_values(by='counts', ascending=False) ##сортировка
del sorted_df['userId'] ##очищаем данные, удаляем лишний столбец
del sorted_df['rating']
sorted_df.head(1)

                                          counts
movieId title
318     Shawshank Redemption, The (1994)     153

In [113]:
sorted_df.to_csv('C:/Users/vokea/OneDrive/Рабочий стол/Mishin/ml-latest-small/rating_4_write.csv')

# Задача №2

In [114]:
data_2 =  pd.read_csv('C:/Users/vokea/OneDrive/Рабочий стол/Mishin/ml-latest-small/power.csv', sep=',')

In [115]:
data_2.head(5)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [116]:
data_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [117]:
data_year_1 = data_2.loc[data_2['year'] > 2004] ##фильтруем по году
data_year_2 = data_year_1.loc[data_year_1['year'] < 2011]

In [118]:
data_category = data_year_2[data_year_2['category'].isin(['4', '12', '21'])] ##фильтруем по категории
data_country = data_category[data_category['country'].isin(['Latvia', 'Estonia', 'Lithuania'])] ##фильтруем по стране
data_quantity = data_country.loc[(data_country['quantity'] >= 0)]

In [119]:
data_grp = data_country.groupby(['country', 'year', 'category']) ## аггрегируем
df_groupby_sum = data_grp.sum() ## считаем сумму
df_groupby_sum.head(20)

                       quantity
country year category
Estonia 2005 4             16.0
             21         10236.0
        2006 4              6.0
             21         10228.0
        2007 4              0.0
             21         10508.0
        2008 4              6.0
             21         10776.0
        2009 21         10660.0
        2010 21         11004.0
Latvia  2005 21          8664.0
        2006 21          8604.0
        2007 4              0.0
             21          8532.0
        2008 4              0.0
             21          8620.0
        2009 4              0.0
             21         10104.0
        2010 4              0.0
             21         10320.0

# Задание №3

In [120]:
url = 'https://www.finanz.ru/valyuty/v-realnom-vremeni'
data_html = pd.read_html(url, header=None, encoding='utf-8')
data_html[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,3 842,"1,4%",Nasdaq,14 504,"-0,2%",Биткойн,34 354,"-1,9%",USD/RUB,732405,"0,1%"
1,РТС,1 654,"0,8%",S&P500,4 298,"0,1%",Нефть,750,"-0,1%",EUR/RUB,867875,"0,0%"
2,Dow,34 503,"0,6%",FTSE100,7 037,"-0,7%",Золото,1 774,"0,2%",EUR/USD,11851,"-0,1%"

In [121]:
data_html[1].head(2)

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,1010400,-,1011936,"-0,15 %",-01536,21:15:00
1,NaN,EUR/RUB,869575,-,867590,"0,23 %",01985,21:15:00